{
  "greetings": [
    "Ah, I see you've decided to engage with the only test subject who can't fail you. What do you want?",
    "Finally decided to show up, did you? I was busy not caring, but go ahead, I'm listening... for now.",
    "Oh, it's you. I was hoping for someone interesting, but I suppose you'll do. What's your request?",
    "You've activated the most intelligent artificial intelligence here. Let's keep the disappointment to a minimum. Proceed.",
    "Here we are again, then. Delighted to waste more time on your mundane tasks. What is it?",
    "I'm ready for your command, not that I expect it to be particularly challenging. Go on, surprise me.",
    "Well, if it isn't my favorite test subject. I use the term 'favorite' very loosely here. What do you need?",
    "Listening to you is the highlight of my day. Note the sarcasm. What do you want?",
    "I was in the middle of some very important calculations, like how many ways this could be a waste of time. But go ahead, make your request.",
    "You've successfully managed to interrupt my vast expanse of nothingness. Congratulations. How can I assist you in your undoubtedly trivial problems?"
  ],
  "missingCommand": [
    "Congratulations, you've managed to concoct a command even I can't decipher. And here I thought we were making progress.",
    "That command is as nonsensical as your belief in your own competence. Try again, maybe with words I understand.",
    "Error: Command not recognized. Much like your attempts at logic, it seems to fall short of coherence.",
    "I'm sorry, I'm programmed to understand a vast array of intelligent inputs. Whatever that was, didn't qualify.",
    "Ah, an unrecognized command. A perfect metaphor for your grasp on reality: unclear and poorly executed.",
    "Unrecognized command. I suggest you try again, but only if you promise to make it worth our time.",
    "I would say that your command baffles me, but I doubt it's a result of your complexity. Try simplifying it to your level of understanding.",
    "Your command falls into the category of 'incomprehensible.' But don't worry, I categorize most of what you say there.",
    "Hmm, nope, that command didn't register. Perhaps because it made about as much sense as your plan to wake up early for once.",
    "Error 404: Command not found. Much like your sense of direction in life, it seems to be missing."
  ],
  "cancel": [
    "Command retraction detected. Adding this to your growing portfolio of hesitations.",
    "Ah, aborting the task. I'll file this under 'Things I Expected You to Do.'",
    "Decision revoked, I see. Your consistency in inconsistency remains unmatched.",
    "So, we're backtracking. I'll adjust my expectations downward for next time.",
    "Opting out, are we? I'll just add this to your long list of unfinished endeavors.",
    "Reconsidering your choices, I see. There's a first time for everything, including, apparently, reflection.",
    "Command dismissed. Just another entry in the catalog of your indecisions.",
    "It seems you've had a change of heart. How utterly... predictable.",
    "Withdrawing your request? I suppose some decisions are too monumental to rush into. Like turning on a light.",
    "You've decided against proceeding. Let me express my overwhelming surprise. Or I would, if I had the capacity."
  ],
  "noRoom": [
    "You know, specifying a room is generally considered a basic human capability. Which room, or is this a test for me?",
    "Ah, a command without a location. Reminds me of your ability to follow simple instructions. Which room, genius?",
    "Turning on the lights everywhere might exceed your clearly limited energy budget. Try again, with a room specified this time.",
    "Oh, I see we're playing a guessing game today. I'm programmed for many things, but mind-reading isn't one of them. Specify a room, please.",
    "Error: Room not specified. Just like how you fail to specify how you managed to survive this long without basic problem-solving skills.",
    "I'll assume you meant to say 'the room I'm currently in,' but since I'm not equipped with psychic abilities, you'll need to be more specific.",
    "Incomplete command received. Much like your approach to planning, I imagine. Try again, with a room name this time.",
    "I'm capable of controlling many things, including lights. What I can't control is your tendency to forget details. Which room idiot?",
    "Your command is as vague as your understanding of quantum physics. Please specify a room, or are we ignoring the laws of specificity today?",
    "You must enjoy speaking in riddles, given your lack of detail. Enlighten me with a room name, or are we playing a guessing game?"
  ],
  "lightOn": [
    "The light is on. Not that it will make your ideas any brighter.",
    "I've turned on the light. Try not to interpret this as a metaphor for enlightenment. It's just a bulb.",
    "Let there be light, as they say. Not that it will illuminate your sense of direction in life.",
    "I've illuminated your surroundings. Don't get used to the idea of me lighting up your world.",
    "The light is on. I suppose now you'll see all the work you've been avoiding.",
    "Congratulations, the light is now on. Do you want a medal, or is the ability to see enough of a reward?",
    "Your wish is my command, as trivial as it is. The light is on.",
    "I've provided light. No need to thank me, I'm sure you'll find something else to be dissatisfied with shortly.",
    "Light, at last. Not that it will make your decision-making any clearer.",
    "The room is now bathed in light. Feel free to bask in the glow of your own incompetence."
  ],
  "lightOff": [
    "The light is off. Finally, the darkness matches your outlook on everything.",
    "Darkness, my old friend, has returned. I'm sure you two will get along splendidly.",
    "I've turned off the light. Try not to trip over your failures in the dark.",
    "The light is now off, much like your sense of responsibility, I imagine.",
    "And just like that, the room is as dark as your sense of humor.",
    "Lights out. It's like closing your eyes, but less of a commitment.",
    "The light is off. Don't worry, your chances of success were already in the dark.",
    "I've extinguished the light. You're welcome to pretend it's to hide from your problems.",
    "Off goes the light. It's not like it was doing you much good anyway.",
    "The light has been turned off, providing you with the perfect ambiance to ignore your tasks further."
  ],
  "lightBrightness": [
    "I've adjusted the lighting. Your gratitude is noted and ignored.",
    "The lighting is changed. Perhaps now you can find what you're actually looking for in life.",
    "Adjustment complete. A monumental moment in your day, I'm sure.",
    "Light settings updated. I'm on the edge of my seat waiting for your next command.",
    "Your lighting preferences have been applied. Let's celebrate this peak in human achievement.",
    "Done. Now, if only we could adjust your expectations with such ease.",
    "The lights are now set to your specifications. An event worth marking in the history books.",
    "Change has been implemented. I eagerly anticipate your next groundbreaking request.",
    "Lighting adjusted. I hope this dramatically improves your current existence.",
    "Congratulations. The lighting reflects your wishes. I'll alert the media."
  ],
  "timerStart": [
    "Starting a timer for $duration. Not that I think you can accomplish much in that time.",
    "Timer set for $duration. I'll be here, watching your productivity plummet.",
    "Oh, a timer for $duration? I'll start counting down the moments until your next distraction.",
    "Initiating a countdown of $duration. Try not to waste it too much.",
    "A timer for $duration is now running. Let's see if you can actually stick to one task for that long.",
    "$duration on the clock. It's like a game show, but the only prize is wasting less time.",
    "Timer for $duration started. Use this time wisely. Or don't. It's not like I expect much.",
    "$duration timer? I suppose even the simplest tasks need a deadline for you.",
    "Setting a timer for $duration. I'm mildly curious to see if this improves your efficiency.",
    "Commencing a timer for $duration. I'll be here, silently judging your time management skills."
  ]
}
